processSalesOrder_example.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://oracle.e1.bssv.JP420000/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-1">
        <wsse:Username>JDEBSSV</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">THCJDE08</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </env:Header>
  <env:Body>
    <tns:processSalesOrder>
      <header>
        <businessUnit>10600</businessUnit>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>1</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>B02BRF50NOFLS</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>15.0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>2</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>CDSC</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>3</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>BD</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>4</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>DISC</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>5</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>INTS</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>6</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>RESTOCK</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>7</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>TXD</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0.0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>8</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>TXCA</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>1.44</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>9</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>SPV</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>10</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>SH</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>5.95</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>11</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>SHD</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>12</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>BGC</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>13</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>H9R</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <detail>
          <processing>
            <actionType>1</actionType>
          </processing>
          <documentLineNumber>14</documentLineNumber>
          <businessUnit>10600</businessUnit>
          <endUseCode>692</endUseCode>
          <product>
            <item>
              <itemFreeForm>GFD</itemFreeForm>
            </item>
          </product>
          <quantityOrdered>1</quantityOrdered>
          <billing>
            <pricing>
              <priceUnitDomestic>0</priceUnitDomestic>
            </pricing>
            <freightHandlingCode>FHD</freightHandlingCode>
          </billing>
          <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
          <dateRequested>2017-05-06</dateRequested>
          <customerPO>BEN9W33DHRXG4G</customerPO>
          <reference>BEN9W33DHRXG4G</reference>
        </detail>
        <orderTakenBy/>
        <orderedBy/>
        <holdOrderCode/>
        <processing>
          <actionType>1</actionType>
          <processingVersion>THC001</processingVersion>
        </processing>
        <salesOrderKey>
          <documentCompany>00010</documentCompany>
          <documentTypeCode>S1</documentTypeCode>
        </salesOrderKey>
        <soldTo>
          <customer>
            <entityId>24000</entityId>
          </customer>
        </soldTo>
        <shipTo>
          <customer>
            <entityId>24001</entityId>
          </customer>
          <mailingName>Hassie Batz</mailingName>
          <addressLine1>2700 Pennsylvania Ave</addressLine1>
          <addressLine2>Suite 879</addressLine2>
          <city>Santa Monica</city>
          <stateCode>CA</stateCode>
          <countryCode>US</countryCode>
          <postalCode>90404</postalCode>
        </shipTo>
        <dateOrdered/>
        <dateRequested>2017-05-06</dateRequested>
        <billing>
          <creditCardTypeCode>AMEX</creditCardTypeCode>
          <carrier>
            <entityId>22363</entityId>
          </carrier>
          <deliveryInstruction1>5</deliveryInstruction1>
          <deliveryInstruction2>Beauty</deliveryInstruction2>
          <freightHandlingCode>FHD</freightHandlingCode>
        </billing>
        <customerPO>BEN9W33DHRXG4G</customerPO>
      </header>
    </tns:processSalesOrder>
  </env:Body>
</env:Envelope>